# Pandas CheatSheet 快查表

In [1]:
import pandas as pd

# DataFrame
- 就是一个SQL的表格Table

张量：二维矩阵即为二维张量
一张RGB图是张量

一个DataFrame 可以被表示成一个json, 也可以被表示成csv
可以被json所初始化

In [2]:
data = {
    'name': ['Alice', 'Bob', 'Charles', 'David', 'Eric'],
    'year': [2017, 2017, 2017, 2017,2017],
    'salary': [40000, 24000, 31000, 20000, 30000],
    'pair':[{'a':1},{'a':2},{'a':3},{'a':4},{'a':5}]
}

In [3]:
d = pd.DataFrame(data)

In [4]:
d

      name  year  salary      pair
0    Alice  2017   40000  {'a': 1}
1      Bob  2017   24000  {'a': 2}
2  Charles  2017   31000  {'a': 3}
3    David  2017   20000  {'a': 4}
4     Eric  2017   30000  {'a': 5}

In [5]:
# 访问数据
d['name']

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [6]:
d.name

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [7]:
# 每一列是Series,相当于数组？
type(d.pair)

pandas.core.series.Series

In [8]:
d.pair.tolist()

[{'a': 1}, {'a': 2}, {'a': 3}, {'a': 4}, {'a': 5}]

In [9]:
d.pair[0]

{'a': 1}

## 薪水大于20000的人都有谁？

In [10]:
d.query('salary>20000')

      name  year  salary      pair
0    Alice  2017   40000  {'a': 1}
1      Bob  2017   24000  {'a': 2}
2  Charles  2017   31000  {'a': 3}
4     Eric  2017   30000  {'a': 5}

In [11]:
d[d.salary>20000]

      name  year  salary      pair
0    Alice  2017   40000  {'a': 1}
1      Bob  2017   24000  {'a': 2}
2  Charles  2017   31000  {'a': 3}
4     Eric  2017   30000  {'a': 5}

In [12]:
d.salary>20000  # 符合的为True

0     True
1     True
2     True
3    False
4     True
Name: salary, dtype: bool

## Eric 的信息是什么？

In [20]:
d.query('name=="Eric"')

   name  year  salary      pair
4  Eric  2017   30000  {'a': 5}

In [21]:
d[d.name=='Eric']

   name  year  salary      pair
4  Eric  2017   30000  {'a': 5}

In [22]:
d.loc[d.name=='Eric']

   name  year  salary      pair
4  Eric  2017   30000  {'a': 5}

## 联合查找：名叫Bob且薪水大于20000?

In [24]:
d.query("name=='Bob' and salary>20000")

  name  year  salary      pair
1  Bob  2017   24000  {'a': 2}

# 列操作
d.filter

在SQL中常使用的SELECT name,year,salary from T where salary>20000 and name=='Eric'事实上是对二阶张量的行和列进行操作

In [25]:
d.filter(items=['name', 'year', 'salary'])

      name  year  salary
0    Alice  2017   40000
1      Bob  2017   24000
2  Charles  2017   31000
3    David  2017   20000
4     Eric  2017   30000

In [26]:
d[['name', 'year']]  # 简化方法删选列

      name  year
0    Alice  2017
1      Bob  2017
2  Charles  2017
3    David  2017
4     Eric  2017

## 模糊查找

In [27]:
d.filter(like='2', axis=0) # 模糊查找行

      name  year  salary      pair
2  Charles  2017   31000  {'a': 3}

In [28]:
d.filter(like='ea', axis=1) # 模糊查找列

   year
0  2017
1  2017
2  2017
3  2017
4  2017